binary_value = "10100"
print(int(binary_value, 2))

# Если требуется перевести число из десятичной системы счисления в двоичную, 
# восьмеричную или шестнадцатеричную, 
# то следует использовать соответственно функции: 
# bin(), oct() и hex(). 
# Эти функции принимают число в десятичной системе счисления, 
# а возвращают строку, представляющую запись числа в соответствующей системе счисления.

# Преобразуем строку '1010' из двоичной системы счисления в десятичное число
# number = int('1010', 2)
# print(number)  # Выведет: 10
# В этом примере:

# '1010' — строковое представление числа в двоичной системе счисления.
# 2 — основание системы счисления (в данном случае это двоичная система).
# Функция int() может быть использована для чисел, записанных в других системах счисления:

# Восьмеричная: int('12', 8) — преобразует строку '12' из восьмеричной системы в десятичное число.
# Шестнадцатеричная: int('A', 16) — преобразует строку 'A' из шестнадцатеричной системы в десятичное число.
# Пример для шестнадцатеричного числа:


# hex_number = int('A', 16)
# print(hex_number)  Выведет: 10