n = 10 # целое число
pi = 3.14 # вещественное число

#int() — преобразует строку (или вещественное число) в целое число. Дополнительно можно указать, в какой системе счисления было записано исходное число. По умолчанию используется десятичная система. При конвертации вещественного числа в целое отбрасывается дробная часть;
#float() — преобразует строку (или целое число) в вещественное число;
#str() — преобразует значения (в общем случае не только числовые) в строки.

n_1 = "1"
n_2 = "2"
print(n_1 + n_2)
n_1 = float(n_1)
n_2 = int(n_2)
print(n_1 + n_2)

x = 3.89
x = int(x)
print(x)

width = "3.7"
height = "2.5"
s = float(width) * float(height)
print(s)

#int_number = int(input())
#float_number = float(input())
#print(int_number * float_number)

#сложение — x + y;
#вычитание — x - y;
#умножение — x * y;
#деление — x / y;
#возведение в степень x ** y.

n = 1234
x = 10

print(f"+ : {n + x}")
print(f"- : {n - x}")
print(f"* : {n * x}")
print(f"/ : {n / x}")
print(f"** : {n ** x}")

print(f"{2 ** 0.5:.3f}") #вывели с точностью до 3 знаков после запятой

print(f"// : {n // x}") #целочисленное деление 

print(f"% : {n % x}") #остаток от деления, последнее число при делении на 10

print(f"% : {n //x % x}") #предпоследнее число

#Порядок выполнения операций (приоритет)

#**;
#*, /, %, //;
#+, -.